{
    "a_flashbanddesign":
    {
        "name" : "Flashband Fliers",
        "parent" : "/#/design",
        "slug" : "a_flashbanddesign",
        "thumb" : "/img/thumb_flashbanddesign.jpg",
        "shortDescription" : "Flashband puts on a number of events throughout the Washington DC area. Each event requires its own graphics and fliers for promotion purposes.",
        "longDescription" : "Flashband showcase events, Flashband’s flagship series, bring together musicians to form temporary bands. At the end of a month these bands are put on a real stage with professional sound and photography.It’s a really fun and unique opportunity for musicians and we try to express that in the graphics for each performance. ",
        "longDescriptionTwo" :"Each event has a theme and these usually make for fun and inventive flyer ideas. As the lead designer for the Flashband staff I get to put together a number of print and web graphics. Using a combination of Photoshop and Illustrator I try my best to quickly explain each event and highlight important information. ",
        "longDescriptionThree" :"",
        "tools" : "groovy on grails",
        "imageOne" : "/img/flashbandflier1.jpg",
        "imageTwo" : "/img/flashbandflier2.jpg",
        "imageThree" : "/img/flashbandflier3.jpg",
        "imageFour" : "/img/flashbandflier4.jpg"
    },
    "b_illustration":
    {
        "name" : "Assorted Illustrations",
        "parent" : "/#/design",
        "slug" : "b_illustration",
        "thumb" : "/img/thumb_illustration.jpg",
        "shortDescription" : "From sketches to commissioned pieces, illustration is one of my favorite things to do.",
        "longDescription" : "These are just a few of the illustrations that fill my computer. Some were commissioned, some were gifts, and some I just created for the fun of it. I love learning new techniques in Illustrator (and sometimes Photoshop) to give new life to my drawings. ",
        "longDescriptionTwo" :"",
        "longDescriptionThree" :"",
        "tools" : "groovy on grails",
        "imageOne" : "/img/illustration1.jpg",
        "imageTwo" : "/img/illustration2.jpg",
        "imageThree" : "/img/illustration3.jpg",
        "imageFour" : "/img/illustration4.jpg"
    },

    "c_music":
    {
        "name" : "Wheelie Fliers",
        "parent" : "/#/design",
        "slug" : "c_music",
        "thumb" : "/img/band1.jpg",
        "shortDescription" : "The D.C. based band, Wheelie, needed a fun and quirky style to match their eclectic music.",
        "longDescription" : "Wheelie was a D.C. based pop/rock band that played at several venues throughout the city from 2011-2013. Wheelie had a fun and funky style and they needed fliers to match. I played around with comic illustrations and bold colors to get the right message across. ",
        "longDescriptionTwo" :"",
        "longDescriptionThree" :"",
        "tools" : "groovy on grails",
        "imageOne" : "/img/band1.jpg",
        "imageTwo" : "/img/band2.jpg",
        "imageThree" : "",
        "imageFour" : ""
    }
}