{
    "a_flashband":
    {
        "name" : "Flashband",
        "parent" : "/#/develop",
        "slug" : "a_flashband",
        "websitename" : "Flashband Website",
	    "url" : "https://flashband.org/",
	    "github" : "",
	    "thumb" : "/img/thumb_flashband.jpg",
        "shortDescription" : "The Flashband website helps musicians meet, network and play music with other people in their area.",
        "longDescription" : "Flashband is an organization that helps musicians meet, network and play music. In addition to being a co-founder of the project, I am also its lead designer and front-end developer.",
        "longDescriptionTwo" :"Since its inception in 2012, Flashband has grown from a few friends using google docs to organize jam sessions to a fully fledged social-media platform. The website helps musicians find and communicate with others in addition to helping them participate in our popular Showcases throughout the city.",
	    "longDescriptionThree" :"The Flashband website is built using Grails, which combines established Java technologies into a modern, high-productivity framework . Within the last year we refactored the site to utilize Bootstrap in order to provide a mobile-first, responsive user experience.. The site also includes integration with Stripe, a credit-card payment system, Google location services for geocoding, as well as Amazon S3 for static content storage.",
        "tools" : "groovy on grails",
	    "imageOne" : "/img/flashband1.jpg",
	    "imageTwo" : "/img/flashband2.jpg",
	    "imageThree" : "/img/flashband3.jpg",
        "imageFour" : "/img/flashband4.jpg"
    },
    "b_map":
    {
        "name" : "Diversity Map",
        "parent" : "/#/develop",
        "slug" : "b_map",
        "websitename" : "Diversity Map",
        "url" : "http://www.gannett-cdn.com/GDContent/2014/diversity-map/index.html",
        "github" : "",
        "thumb" : "/img/thumb_map.jpg",
        "shortDescription" : "This map uses the USA Today Diversity Index to show how diversity has surged in the last 50 years and is expected to continue rising.",
        "longDescription" : "The USA TODAY 'diversity index' calculates the chance that two random people in area are different by race or ethnicity. It was was created using Census data and has been calculated for counties across the US every year since 1960. The scale ranges from 0-100.",
        "longDescriptionTwo" :"This diversity map illustrates the data both by location and chronology. Users can hover over cities or use the slider at the base of the map to view results. Both the map and the bar charts were created using the d3.js library. ",
        "longDescriptionThree" :"I worked as the sole developer on this project and it was my first exposure to topoJSON encoding and the d3.js library. JSON files provided the information for the map and I utilized queue.js to manage data loading. Additionally, I styled the experience using existing USA Today guidelines.",
        "tools" : "groovy on grails",
        "imageOne" : "/img/diversity1.jpg",
        "imageTwo" : "/img/diversity2.jpg",
        "imageThree" : "/img/diversity3.jpg",
        "imageFour" : "/img/diversity4.jpg"
    },
    "c_ghost":
    {
        "name" : "Ghost Factories",
        "parent" : "/#/develop",
        "slug" : "c_ghost",
        "websitename" : "The Ghost Factories Experience",
        "url" : "http://usatoday30.usatoday.com/news/nation/smelting-lead-contamination",
        "github" : "",
        "thumb" : "/img/thumb_ghost.jpg",
        "shortDescription" : "The USA Today Ghost Factories report explores how smelting practices by factories across the US have left the surrounding soil poisoned and dangerous for current populations.",
        "longDescription" : "The Ghost Factories series investigated hundreds of forgotten lead factories and the health hazards they left behind. Hundreds of neighborhoods may be contaminated with dangerous levels of lead from factories that operated in the 1930s to 1960s, but little has been done to investigate many of the sites or warn people living nearby of the dangers to their children from playing in the dirt and putting dusty hands or toys in their mouths.",
        "longDescriptionTwo" :"This was a large collaborative effort across many departments in the USA Today and Gannett Digital staff. My largest contributions to the project involved the mapping portions of the project. I worked with google maps to create image overlays and informative pop-ups to make the experience as comprehensive as possible.",
        "longDescriptionThree" :"This project won several national awards including the top prize for online journalism in the Gerald Loeb Awards and the Silver Award in the 2012 Barlett & Steele Awards. Additionally, it was selected internally by Gannett for first place in Public Service Journalism Use of Integrated Media. ",
        "tools" : "groovy on grails",
        "imageOne" : "/img/ghost1.jpg",
        "imageTwo" : "/img/ghost2.jpg",
        "imageThree" : "/img/ghost3.jpg",
        "imageFour" : "/img/ghost4.jpg"
    },
    "d_elections":
    {
        "name" : "2014 Election Interactive",
        "parent" : "/#/develop",
        "slug" : "d_elections",
        "websitename" : "USA Today 2014 Elections",
        "url" : "http://www.usatoday.com/pages/interactives/elections-forecast-2014/",
        "github" : "",
        "thumb" : "/img/thumb_election.jpg",
        "shortDescription" : "Using a variety of infographics and maps, this interactive tracked the progress of the 2014 senate and house elections across the USA.",
        "longDescription" : "Elections are an extremely important in the newspaper industry and the 2014 Senate, House, and Governor election forecast app was a huge undertaking for the digital team. The app was built on a Backbone framework and utilizes Twitter’s Bootstrap to maintain a clean and responsive experience across platforms. The Sunlight foundation provided all data for the app and we were able to present information in real time. ",
        "longDescriptionTwo" :"I focused mostly on the charts and maps throughout the experience. These were hosted externally and iframed into the app. Through color coding and tooltips, these elements provided a quick snapshot of election results. ",
        "longDescriptionThree" :"",
        "tools" : "groovy on grails",
        "imageOne" : "/img/election1.jpg",
        "imageTwo" : "/img/election2.jpg",
        "imageThree" : "/img/election3.jpg",
        "imageFour" : "/img/election4.jpg"
    }
}